Reading Data From Different Sources

In [1]:
import pandas as pd
from io import StringIO
Data = '{"employee_name"  : "James", "email" : "james@gmail.com", "job_profile" : [{"title1" : "Team Lead", "title2" : "Sr. Developer"}]}'
df = pd.read_json(StringIO(Data))

In [2]:
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [3]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [4]:
df.to_json(orient = 'index')

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [5]:
df.to_json(orient = 'records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [6]:
df.head()

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [7]:
pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data", header=None)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740
174,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750
175,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835
176,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840
177,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560

In [8]:
df.head()

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [9]:
df.to_csv('wine.csv')

In [10]:
!pip install lxml

Requirement already satisfied: lxml in c:\ml nabin\venv\lib\site-packages (5.3.0)

In [11]:
!pip install html5lib

Requirement already satisfied: html5lib in c:\ml nabin\venv\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\ml nabin\venv\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\ml nabin\venv\lib\site-packages (from html5lib) (0.5.1)

In [12]:
!pip install beautifulsoup4

Requirement already satisfied: beautifulsoup4 in c:\ml nabin\venv\lib\site-packages (4.12.3)
Requirement already satisfied: soupsieve>1.2 in c:\ml nabin\venv\lib\site-packages (from beautifulsoup4) (2.6)

In [14]:
url = "https://www.fdic.gov/bank/individual/failed/banklist.html"
df = pd.read_html(url)

In [15]:
df

[                               Bank Name               City          State  \
 0  Republic First Bank dba Republic Bank       Philadelphia   Pennsylvania
 1                          Citizens Bank           Sac City           Iowa
 2               Heartland Tri-State Bank            Elkhart         Kansas
 3                    First Republic Bank      San Francisco     California
 4                         Signature Bank           New York       New York
 5                    Silicon Valley Bank        Santa Clara     California
 6                      Almena State Bank             Almena         Kansas
 7             First City Bank of Florida  Fort Walton Beach        Florida
 8                   The First State Bank      Barboursville  West Virginia
 9                     Ericson State Bank            Ericson       Nebraska

     Cert                 Aquiring Institution       Closing Date  \
 0  27332    Fulton Bank, National Association     April 26, 2024
 1   8758            Iowa Trust & Savings Bank   November 3, 2023
 2  25851               Dream First Bank, N.A.      July 28, 2023
 3  59017            JPMorgan Chase Bank, N.A.        May 1, 2023
 4  57053                  Flagstar Bank, N.A.     March 12, 2023
 5  24735  First Citizens Bank & Trust Company     March 10, 2023
 6  15426                          Equity Bank   October 23, 2020
 7  16748            United Fidelity Bank, fsb   October 16, 2020
 8  14361                       MVB Bank, Inc.      April 3, 2020
 9  18265           Farmers and Merchants Bank  February 14, 2020

    Fund  Sort ascending
 0                 10546
 1                 10545
 2                 10544
 3                 10543
 4                 10540
 5                 10539
 6                 10538
 7                 10537
 8                 10536
 9                 10535  ]

In [16]:
df[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
5,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
6,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
7,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
8,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
9,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535